Tekla Open API Reference for Tekla Structures 2025
ReferenceModel Constructor (String, Point, Double)
 Initializes a new instance of the ReferenceModel class. Creates a new reference model instance using the given filename, position and scale.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReferenceModel(
	string filename,
	Point position,
	double scale
)
Public Sub New (
	filename As String,
	position As Point,
	scale As Double
)
Parameters
filename
Type: System.String
 The filename to be used.
position
Type: Tekla.Structures.Geometry3d.Point
 The position to be used.
scale
Type: System.Double
 The scale to be used.
See Also
Reference
ReferenceModel Class
ReferenceModel Overload
Tekla.Structures.Model Namespace